table_mend=[
    {"formul":"H", "atom_mass":1, "id":1, "name":"Водород", "description":"Легчайший и наиболее распространенный химический элемент","met":False},
    {"formul":"He", "atom_mass":4, "id":2, "name":"Гелий", "description":"Инертный газ, используемый в аэростатах и криогенике","met":False},
    {"formul":"Li", "atom_mass":7, "id":3, "name":"Литий", "description":"Легкий металл, используемый в аккумуляторах и ядерной энергетике","met":True},
    {"formul":"Be", "atom_mass":9, "id":4, "name":"Бериллий", "description":"Легкий металл, используемый в аэрокосмической и ядерной промышленности","met":True},
    {"formul":"B", "atom_mass":11, "id":5, "name":"Бор", "description":"Полуметалл, используемый в производстве стекла и керамики","met":False},
    {"formul":"C", "atom_mass":12, "id":6, "name":"Углерод", "description":"Основной элемент жизни, входящий в состав всех органических соединений","met":False},
    {"formul":"N", "atom_mass":14, "id":7, "name":"Азот", "description":"Инертный газ, составляющий большую часть воздуха","met":False},
    {"formul":"O", "atom_mass":16, "id":8, "name":"Кислород", "description":"Необходимый для дыхания элемент, составляющий большую часть воздуха","met":False},
    {"formul":"F", "atom_mass":19, "id":9, "name":"Фтор", "description":"Самый реактивный элемент, используемый в производстве фторопластов","met":False},
    {"formul":"Ne", "atom_mass":20, "id":10, "name":"Неон", "description":"Инертный газ, используемый в рекламных вывесках и лазерах","met":True},
    {"formul":"Na", "atom_mass":23, "id":11, "name":"Натрий", "description":"Алкалий, используемый в производстве мыла и стекла","met":True},
    {"formul":"Mg", "atom_mass":24, "id":12, "name":"Магний", "description":"Легкий металл, используемый в производстве сплавов и пиротехники","met":True},
    {"formul":"Al", "atom_mass":27, "id":13, "name":"Алюминий", "description":"Легкий металл, используемый в производстве самолетов и упаковки"},
    {"formul":"Si", "atom_mass":28, "id":14, "name":"Кремний", "description":"Полуметалл, используемый в производстве полупроводников и бетона"},
    {"formul":"P", "atom_mass":31, "id":15, "name":"Фосфор", "description":"Необходимый для жизни элемент, используемый в производстве удобрений"},
    {"formul":"S", "atom_mass":32, "id":16, "name":"Сера", "description":"Необходимый для жизни элемент, используемый в производстве серной кислоты"},
    {"formul":"Cl", "atom_mass":35.5, "id":17, "name":"Хлор", "description":"Токсичный газ, используемый в производстве хлорки и дезинфицирующих средств"},
    {"formul":"Ar", "atom_mass":40, "id":18, "name":"Аргон", "description":"Инертный газ, используемый в производстве ламп и криогенике"},
    {"formul":"K", "atom_mass":39, "id":19, "name":"Калий", "description":"Алкалий, используемый в производстве удобрений и взрывчатых веществ"},
    {"formul":"Ca", "atom_mass":49, "id":20, "name":"Кальций", "description":"Необходимый для жизни элемент, используемый в производстве цемента и удобрений"},
    {"formul":"Sc", "atom_mass":21, "id":21, "name":"Скандий", "description":"Редкоземельный металл, используемый в производстве сплавов и катализаторов"},
    {"formul":"Ti", "atom_mass":48, "id":22, "name":"Титан", "description":"Легкий металл, используемый в производстве сплавов и аэрокосмической промышленности"},
    {"formul":"V", "atom_mass":51, "id":23, "name":"Ванадий", "description":"Редкоземельный металл, используемый в производстве сплавов и катализаторов"},
    {"formul":"Cr", "atom_mass":52, "id":24, "name":"Хром", "description":"Тяжелый металл, используемый в производстве нержавеющей стали и хромирования"},
    {"formul":"Mn", "atom_mass":55, "id":25, "name":"Марганец", "description":"Тяжелый металл, используемый в производстве сплавов и аккумуляторов"},
    {"formul":"Fe", "atom_mass":56, "id":26, "name":"Железо", "description":"Тяжелый металл, используемый в производстве стали и магнитов"},
    {"formul":"Co", "atom_mass":59, "id":27, "name":"Кобальт", "description":"Тяжелый металл, используемый в производстве сплавов и магнитов"},
    {"formul":"Ni", "atom_mass":59, "id":28, "name":"Никель", "description":"Тяжелый металл, используемый в производстве сплавов и аккумуляторов"},
    {"formul":"Cu", "atom_mass":64, "id":29, "name":"Медь", "description":"Тяжелый металл, используемый в производстве электрических проводов и сплавов"},
    {"formul":"Zn", "atom_mass":65, "id":30, "name":"Цинк", "description":"Тяжелый металл, используемый в производстве гальванических покрытий и аккумуляторов"},
    {"formul":"Ga","atom_mass":70,"id":31, "name":"Галлий", "description":"Полупроводниковый материал, используется в электронике"},
    {"formul":"Ge","atom_mass":73,"id":32, "name":"Германий", "description":"Полупроводниковый материал, используется в электронике и оптике"},
    {"formul":"As","atom_mass":75,"id":33, "name":"Мышьяк", "description":"Ядовитый элемент, используется в производстве полупроводников и в медицине"},
    {"formul":"Se","atom_mass":79,"id":34, "name":"Селен", "description":"Полупроводниковый материал, используется в электронике и фотографии"},
    {"formul":"Br","atom_mass":80,"id":35, "name":"Бром", "description":"Химический элемент, используется в производстве лекарств и в фотографии"},
    {"formul":"Kr","atom_mass":84,"id":36, "name":"Криптон", "description":"Инертный газ, используется в лампах и в криогенике"},
    {"formul":"Rb","atom_mass":85,"id":37, "name":"Рубидий", "description":"Алкалий, используется в атомных часах и в производстве специальных стёкол"},
    {"formul":"Sr","atom_mass":88,"id":38, "name":"Стронций", "description":"Алкалий, используется в производстве пиротехники и в медицине"},
    {"formul":"Y","atom_mass":89,"id":39, "name":"Иттрий", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Zr","atom_mass":91,"id":40, "name":"Цирконий", "description":"Тяжёлый металл, используется в ядерной энергетике и в производстве спецматериалов"},
    {"formul":"Nb","atom_mass":93,"id":41, "name":"Ниобий", "description":"Тяжёлый металл, используется в производстве спецматериалов и в ядерной энергетике"},
    {"formul":"Mo","atom_mass":96,"id":42, "name":"Молибден", "description":"Тяжёлый металл, используется в производстве спецматериалов и в ядерной энергетике"},
    {"formul":"Tc","atom_mass":98,"id":43, "name":"Технеций", "description":"Радиоактивный элемент, используется в медицине и в ядерной энергетике"},
    {"formul":"Ru","atom_mass":101,"id":44, "name":"Рутений", "description":"Тяжёлый металл, используется в электронике и в производстве спецматериалов"},
    {"formul":"Rh","atom_mass":103,"id":45, "name":"Родий", "description":"Тяжёлый металл, используется в электронике и в производстве спецматериалов"},
    {"formul":"Pd","atom_mass":106,"id":46, "name":"Палладий", "description":"Тяжёлый металл, используется в электронике и в производстве спецматериалов"},
    {"formul":"Ag","atom_mass":108,"id":47, "name":"Серебро", "description":"Благородный металл, используется в электронике, в производстве спецматериалов и в ювелирном деле"},
    {"formul":"Cd","atom_mass":112,"id":48, "name":"Кадмий", "description":"Тяжёлый металл, используется в электронике и в производстве спецматериалов"},
    {"formul":"In","atom_mass":115,"id":49, "name":"Индиий", "description":"Полупроводниковый материал, используется в электронике и в производстве спецматериалов"},
    {"formul":"Sn","atom_mass":119,"id":50, "name":"Олово", "description":"Полупроводниковый материал, используется в электронике и в производстве спецматериалов"},
    {"formul":"Sb","atom_mass":122,"id":51, "name":"Сурьма", "description":"Полупроводниковый материал, используется в электронике и в производстве спецматериалов"},
    {"formul":"Te","atom_mass":128,"id":52, "name":"Теллур", "description":"Полупроводниковый материал, используется в электронике и в производстве спецматериалов"},
    {"formul":"I","atom_mass":127,"id":53, "name":"Йод", "description":"Химический элемент, используется в медицине и в производстве спецматериалов"},
    {"formul":"Xe","atom_mass":131,"id":54, "name":"Ксенон", "description":"Инертный газ, используется в лампах и в криогенике"},
    {"formul":"Cs","atom_mass":133,"id":55, "name":"Цезий", "description":"Алкалий, используется в атомных часах и в производстве специальных стёкол"},
    {"formul":"Ba","atom_mass":137,"id":56, "name":"Барий", "description":"Алкалий, используется в производстве пиротехники и в медицине"},
    {"formul":"La","atom_mass":139,"id":57, "name":"Лантан", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Ce","atom_mass":140,"id":58, "name":"Церий", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Pr","atom_mass":141,"id":59, "name":"Празеодим", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Nd","atom_mass":144,"id":60, "name":"Неодим", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Pm","atom_mass":145,"id":61, "name":"Прометий", "description":"Радиоактивный металл, используется в ядерной энергетике и в медицине"},
    {"formul":"Sm","atom_mass":150,"id":62, "name":"Самарий", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Eu","atom_mass":152,"id":63, "name":"Европий", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Gd","atom_mass":157,"id":64, "name":"Гадолиний", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Tb","atom_mass":159,"id":65, "name":"Тербий", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Dy","atom_mass":162.5,"id":66, "name":"Диспрозий", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Ho","atom_mass":165,"id":67, "name":"Гольмий", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Er","atom_mass":167,"id":68, "name":"Эрбий", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Tm","atom_mass":169,"id":69, "name":"Тулий", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Yb","atom_mass":173,"id":70, "name":"Иттербий", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Lu","atom_mass":175,"id":71, "name":"Лутетий", "description":"Редкоземельный элемент, используется в электронике и в производстве спецматериалов"},
    {"formul":"Hf","atom_mass":178.5,"id":72, "name":"Гафний", "description":"Тяжёлый металл, используется в ядерной энергетике и в производстве спецматериалов"},
    {"formul":"Ta","atom_mass":181,"id":73, "name":"Тантал", "description":"Тяжёлый металл, используется в электронике и в производстве спецматериалов"},
    {"formul":"W","atom_mass":184,"id":74, "name":"Вольфрам", "description":"Тяжёлый металл, используется в электронике и в производстве спецматериалов"},
    {"formul":"Re","atom_mass":186,"id":75, "name":"Рений", "description":"Тяжёлый металл, используется в электронике и в производстве спецматериалов"},
    {"formul":"Os","atom_mass":190,"id":76, "name":"Осмий", "description":"Тяжёлый металл, используется в электронике и в производстве спецматериалов"},
    {"formul":"Ir","atom_mass":192,"id":77, "name":"Иридий", "description":"Тяжёлый металл, используется в электронике и в производстве спецматериалов"},
    {"formul":"Pt","atom_mass":195,"id":78, "name":"Платина", "description":"Благородный металл, используется в электронике, в производстве спецматериалов и в ювелирном деле"},
    {"formul":"Au","atom_mass":197,"id":79, "name":"Золото", "description":"Благородный металл, используется в электронике, в производстве спецматериалов и в ювелирном деле"},
    {"formul":"Hg","atom_mass":201,"id":80, "name":"Ртуть", "description":"Химический элемент, используется в медицине и в производстве спецматериалов"},
    {"formul":"Tl","atom_mass":204,"id":81, "name":"Таллий", "description":"Полупроводниковый материал, используется в электронике и в производстве спецматериалов"},
    {"formul":"Pb","atom_mass":207,"id":82, "name":"Свинец", "description":"Полупроводниковый материал, используется в электронике и в производстве спецматериалов"},
    {"formul":"Bi","atom_mass":209,"id":83, "name":"Висмут", "description":"Полупроводниковый материал, используется в электронике и в производстве спецматериалов"},
    {"formul":"Po","atom_mass":209,"id":84, "name":"Полоний", "description":"Радиоактивный элемент, используется в ядерной энергетике и в медицине"},
    {"formul":"At","atom_mass":210,"id":85, "name":"Астат", "description":"Радиоактивный элемент, используется в ядерной энергетике и в медицине"},
    {"formul":"Rn","atom_mass":222,"id":86, "name":"Радон", "description":"Инертный газ, используется в лампах и в криогенике"},
    {"formul":"Fr","atom_mass":223,"id":87, "name":"Франций", "description":"Алкалий, используется в атомных часах и в производстве специальных стёкол"},
    {"formul":"Ra","atom_mass":226,"id":88, "name":"Радий", "description":"Алкалий, используется в производстве пиротехники и в медицине"},
    {"formul":"Ac","atom_mass":227,"id":89, "name":"Актиний", "description":"Радиоактивный металл, используется в ядерной энергетике и в медицине"},
    {"formul":"Th","atom_mass":232,"id":90, "name":"Торий", "description":"Радиоактивный металл, используется в ядерной энергетике и в медицине"},
    {"formul":"Pa","atom_mass":231,"id":91, "name":"Протактиний", "description":"Радиоактивный металл, используется в ядерной энергетике"},
    {"formul":"U","atom_mass":238,"id":92, "name":"Уран", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Np","atom_mass":237,"id":93, "name":"Нептуний", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Pu","atom_mass":224,"id":94, "name":"Плутоний", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Am","atom_mass":243,"id":95, "name":"Америций", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Cm","atom_mass":247,"id":96, "name":"Кюрий", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Bk","atom_mass":247,"id":97, "name":"Берклий", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Cf","atom_mass":251,"id":98, "name":"Калифорний", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Es","atom_mass":252,"id":99, "name":"Эйнштейний", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Fm","atom_mass":257,"id":100, "name":"Фермий", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Md","atom_mass":258,"id":101, "name":"Менделевий", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"No","atom_mass":258,"id":102, "name":"Нобелий", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Lr","atom_mass":260,"id":103, "name":"Лоуренсий", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Rf","atom_mass":261,"id":104, "name":"Резерфордий", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Db","atom_mass":262,"id":105, "name":"Дубний", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Sg","atom_mass":266,"id":106, "name":"Сиборгий", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Bh","atom_mass":267,"id":107, "name":"Борий", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Hs","atom_mass":269,"id":108, "name":"Хассий", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Mt","atom_mass":268,"id":109, "name":"Мейтнерий", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"},
    {"formul":"Ds","atom_mass":271,"id":110, "name":"Дармштадтий", "description":"Радиоактивный металл, используется в ядерной энергетике и ядерном оружии"}
]

metal_activity = ["Li", "Rb", "K", "Ba", "Sr", "Ca", "Na", "Mg", "Al", "Mn", "Zn", "Cr", "Fe", "Cd", "Co", "Ni", "Sn", "Pb", "H2", "Sb", "Bi", "Cu", "Hg", "Ag", "Au"]

upReg= "QWERTYUIOPASDFGHJKLZXCVBNM"
downReg= "qwertyuiopasdfghjklzxcvbnm"
num ="1234567890"
funcSumbol = "+="

def compare_metal_positions(metal1, metal2):
    """
    Compare the positions of two metals in the activity series.

    Args:
        metal_activity (list): The complete activity series of metals.
        metal1 (str): The first metal to compare.
        metal2 (str): The second metal to compare.

    Returns:
        bool or None: True if metal1 comes after metal2, False if metal1 comes before metal2, or None if one or both metals are not in the activity series.
    """
    if metal1 not in metal_activity or metal2 not in metal_activity:
        return None

    index1 = metal_activity.index(metal1)
    index2 = metal_activity.index(metal2)

    if index1 < index2:
        return False
    elif index1 > index2:
        return True
    else:
        return None




def get_use_id(id_):
    for dobject in table_mend:
        if id_ == dobject.get("id"):
            return dobject

def get_use_formul(formul_):
    for dobject in table_mend:
        if formul_ == dobject.get("formul"):
            return dobject

def get_use_name(name_):
    for dobject in table_mend:
        if name_.lower() == dobject.get("name").lower():
            return dobject
        
def get_use_atom_mass(mass_):
    for dobject in table_mend:
        if mass_ == dobject.get("atom_mass"):
            return dobject